//                    -------------------------Arrow Functions------------------------------

// let func = (arg1, arg2, ...argN) => expression;
// «функции-стрелки» или «стрелочные функции» (arrow functions)

//Это сокращенная запись function expression
//Стрелочные функции можно использовать так же, как и Function Expression.





/* При этом важное отличие – в том, что в таких скобках для возврата значения нужно использовать return
(как в обычных функциях).*/

let sum = (a, b) => {  // фигурная скобка, открывающая тело многострочной функции
  let result = a + b;
  return result; // если мы используем фигурные скобки, то нам нужно явно указать "return"
};

alert( sum(1, 2) ); // 3



/*
Итого
Стрелочные функции очень удобны для простых действий, особенно для однострочных.
  Они бывают двух типов:

  1) Без фигурных скобок: (...args) => expression – правая сторона выражения:
  функция вычисляет его и возвращает результат.
  Скобки можно не ставить, если аргумент только один: n => n * 2.

  2) C фигурными скобками: (...args) => { body } – скобки позволяют нам писать несколько инструкций внутри функции,
  но при этом необходимо явно вызывать return, чтобы вернуть значение.
*/



//Перепишите с использованием функции-стрелки

function ask(question, yes, no) {
  if (confirm(question)) yes()
  else no();
}

ask(
  "Вы согласны?",
  () => alert("Вы согласились."),
  () => alert("Вы отменили выполнение.")
);

