//Модуль – это просто файл. Один скрипт – это один модуль.

// export отмечает переменные и функции, которые должны быть доступны вне текущего модуля.
// import позволяет импортировать функциональность из других модулей.

//Всегда «use strict»

//Каждый модуль имеет свою собственную область видимости,
// переменные и функции, объявленные в модуле, не видны в других скриптах.

/*
– модуль выполняется только один раз. Генерируется экспорт и после передаётся всем импортёрам,
  поэтому, если что-то изменится в объекте admin, то другие модули тоже увидят эти изменения.*/


