//---------------------------------------Object to primitive conversion-------------------------------------------------

//Преобразование объекта в примитив вызывается автоматически многими встроенными функциями и операторами,
// которые ожидают примитив в качестве значения.

/*
Существует всего 3 типа (хинта) для этого:

"string" (для alert и других операций, которым нужна строка)
"number" (для математических операций)
"default" (для некоторых других операторов, обычно объекты реализуют его как "number")

*/

/*На практике часто бывает достаточно реализовать только obj.toString() в качестве универсального метода
для преобразований к строке, который должен возвращать удобочитаемое представление объекта для
целей логирования или отладки.*/
