//                                   ---------------Interaction задачи------------------

/*
alert
показывает сообщение.
  prompt
показывает сообщение и запрашивает ввод текста от пользователя.
Возвращает напечатанный в поле ввода текст или null, если была нажата кнопка «Отмена» или Esc с клавиатуры.
  confirm
показывает сообщение и ждёт, пока пользователь нажмёт OK или Отмена.
  Возвращает true, если нажата OK, и false, если нажата кнопка «Отмена» или Esc с клавиатуры.
*/

// Создайте страницу, которая спрашивает имя у пользователя и выводит его.

let name = prompt('What is your name?', '');
alert(`Hi, ${name}`);
