//------------------------------------------------Symbol type----------------------------------------------------------

//«Символ» представляет собой уникальный идентификатор.
// Создаём новый символ - id
let id = Symbol();

// Создаём символ id с описанием (именем) "id"
let id2 = Symbol("id");

/*
Символы гарантированно уникальны. Даже если мы создадим множество символов с одинаковым описанием,
  это всё равно будут разные символы. Описание – это просто метка, которая ни на что не влияет.
  */

//К символьным свойствам нельзя получить доступ случайно Это – часть общего принципа «сокрытия символьных свойств».
// Если другая библиотека или скрипт будут работать с нашим объектом,
// то при переборе они не получат ненароком наше символьное свойство.