//-------------------------------------------------Microtasks-------------------------------------------------------------

// Обработка промисов всегда асинхронная, т.к. все действия промисов проходят через внутреннюю очередь «promise jobs», так называемую «очередь микрозадач (microtask queue)» (термин v8).

// Таким образом, обработчики .then/catch/finally вызываются после выполнения текущего кода.

// Если нам нужно гарантировать выполнение какого-то кода после .then/catch/finally, то лучше всего добавить его вызов в цепочку .then.
