//-----------------------------------------------Promises chaining------------------------------------------------------

// Если обработчик в .then (или в catch/finally, без разницы) возвращает промис, последующие элементы цепочки ждут,
// пока этот промис выполнится. Когда это происходит, результат его выполнения (или ошибка) передаётся дальше.

//Промисы: сравните then и catch
promise.then(f1).catch(f2);
promise.then(f1, f2);

//.then передаёт результат или ошибку следующему блоку .then/catch. Так как в первом примере в цепочке далее имеется блок catch, а во втором – нет, то ошибка в нём останется необработанной.
