//------------------------------------------------Rest parameters and spread syntax-------------------------------------

//Если ... располагается в конце списка параметров функции,
//то это «ОСТАТОЧНЫЕ ПАРАМЕТРЫ». Он собирает остальные неуказанные аргументы и делает из них массив.

function showName(firstName, lastName, ...titles) {
  alert( firstName + ' ' + lastName ); // Юлий Цезарь

  // Оставшиеся параметры пойдут в массив
  // titles = ["Консул", "Император"]
  alert( titles[0] ); // Консул
  alert( titles[1] ); // Император
  alert( titles.length ); // 2
}
showName("Юлий", "Цезарь", "Консул", "Император");


//Если ... встретился в вызове функции или где-либо ещё, то это «ОПЕРАТОР РАСШИРЕНИЯ». Он извлекает элементы из массива.
let arr1 = [1, -2, 3, 4];
let arr2 = [8, 3, -8, 1];

alert( Math.max(1, ...arr1, 2, ...arr2, 25) ); // 25